package recursion;
// プログラムで関数が呼び出されると、オペレーティングシステムはコールスタック（call stack）と呼ばれる領域に、パラメータや実行終了後に戻るべきコード内の場所など、

// 関数に関する情報を格納する。
// コールスタックは、プログラム内で行われた関数呼び出しを追跡するために使用される特別なデータ構造で、プログラムの実行方法において重要な役割を担っています。

public class stack {

  // 問題を解くのに時間を要したかを数値で表したものを計算量（complexity）という
  // 計算量の中でも時間的にどのくらい時間を要したか,空間的にどれほど手間を要したかによって、2 種類に分けられる。
  // それぞれ時間計算量（time complexity）と空間計算量（space complexity）と呼ばれる。
  // 詳しく言うと、コンピュータが特定の手順に従って与えられた問題を解く際に必要とする手順の回数のことを時間計算量（time complexity）といい、
  // 必要とする記憶領域の容量のことを空間計算量（space complexity）といいます。

}
